Revit 2027 API
DuctFittingAndAccessoryData.SystemClassification Property
 The system classification of the duct fitting or duct accessory.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPSystemClassification SystemClassification { get; }
Public ReadOnly Property SystemClassification As MEPSystemClassification
	Get
public:
property MEPSystemClassification SystemClassification {
	MEPSystemClassification get ();
}
member SystemClassification : MEPSystemClassification with get
Property Value
MEPSystemClassification
See Also
Reference
DuctFittingAndAccessoryData Class
Autodesk.Revit.DB.Mechanical Namespace